#include <stdio.h>
#include <string.h>
#include "interpreter.h"

int main() {

    char file[100];

    printf(" ███╗   ██╗██╗   ██╗███╗   ███╗███████╗██████╗ ██╗ ██████╗ █████╗ ██╗     \n");
    printf(" ████╗  ██║██║   ██║████╗ ████║██╔════╝██╔══██╗██║██╔════╝██╔══██╗██║     \n");
    printf(" ██╔██╗ ██║██║   ██║██╔████╔██║█████╗  ██████╔╝██║██║     ███████║██║     \n");
    printf(" ██║╚██╗██║██║   ██║██║╚██╔╝██║██╔══╝  ██╔══██╗██║██║     ██╔══██║██║     \n");
    printf(" ██║ ╚████║╚██████╔╝██║ ╚═╝ ██║███████╗██║  ██║██║╚██████╗██║  ██║███████╗\n");
    printf(" ╚═╝  ╚═══╝ ╚═════╝ ╚═╝     ╚═╝╚══════╝╚═╝  ╚═╝╚═╝ ╚═════╝╚═╝  ╚═╝╚══════╝\n");

    printf("Type 'exit' to quit\n");

    while (1) {

        printf("\nEnter file path: ");
        if (!fgets(file, sizeof(file), stdin))
            break;
        
        printf("\n");

        file[strcspn(file, "\n")] = 0;

        if (strcmp(file, "exit") == 0)
            break;

        run_file(file);

        printf("\n");
    }

    return 0;
}
